Repository: sesebaby/Hermes-Desktop
Catalog: Desktop/HermesDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# SettingsModelApiKeyEnvRequired
source: API key env var is required for API Key (Env Var).
zh_cn: 使用「API 密钥（环境变量）」时必须填写 API 密钥环境变量。

# SettingsModelOAuthEnvRequired
source: Token env var is required for OAuth Proxy (Env Token).
zh_cn: 使用「OAuth 代理（环境令牌）」时必须填写令牌环境变量。

# SettingsModelOAuthCommandRequired
source: Token command is required for OAuth Proxy (Command Token).
zh_cn: 使用「OAuth 代理（命令令牌）」时必须填写令牌命令。

# SettingsModelContextFormat
source: Context: {0}
zh_cn: 上下文：{0}

# SettingsModelContextUnknown
source: Context: --
zh_cn: 上下文：--

# TaskPanelTitle.Text
source: Tasks
zh_cn: 任务

source: Refresh tasks and task archive
zh_cn: 刷新任务和任务归档

# TaskPanelLiveTitle.Text
source: Current
zh_cn: 当前

# TaskPanelEmptyState.Text
source: No active tasks yet. Tasks appear while Hermes works.
zh_cn: 暂无活动任务。 Hermes 工作时会在这里显示任务。

# TaskPanelLiveList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Current task list
zh_cn: 当前任务列表

# TaskPanelArchiveTitle.Text
source: Archive
zh_cn: 归档

# TaskPanelArchiveEmptyState.Text
source: No archived todo turns yet.
zh_cn: 暂无已归档的 todo 回合。

source: Archived todo turns
zh_cn: 已归档的 todo 回合

# TaskPanelArchiveComplete
source: Complete
zh_cn: 已完成

# TaskPanelArchiveIncompleteFormat
source: {0} open
zh_cn: {0} 个未完成

# TaskPanelArchiveTurnFormat
source: Turn {0}
zh_cn: 第 {0} 轮

# DashNpcRuntimeBridgeAttached
source: Attached
zh_cn: 已连接

# DashNpcRuntimeBridgeNotConnected
source: Not connected
zh_cn: 未连接

# DashNpcRuntimeLoopSummaryFormat
source: Loop: {0} | Wait: {1}
zh_cn: 循环：{0} | 等待：{1}

# DashNpcRuntimeLeaseActionSummaryFormat
source: Session: {0} | Action: {1}
zh_cn: 会话：{0} | 动作：{1}

# DashNpcRuntimeIngressPendingCursorSummaryFormat
source: Ingress: {0} | Pending: {1} | Cursor: {2}
zh_cn: 入口：{0} | 待处理：{1} | 游标：{2}

# DashNpcRuntimePendingCursorSummaryFormat
source: Pending: {0} | Cursor: {1}
zh_cn: 待处理：{0} | 游标：{1}

# DashNpcRuntimeWaitUntilFormat
source: {0} until {1}
zh_cn: {0}，直到 {1}

# DashNpcRuntimeCursorSequenceFormat
source: seq {0}
zh_cn: 序号 {0}

# DashNpcRuntimeTasksFormat
source: Tasks: {0} active | {1} blocked | {2} failed
zh_cn: 任务：{0} 个活动 | {1} 个阻塞 | {2} 个失败

# DashNpcRuntimeTaskFailureFormat
source: Task issue: {0}
zh_cn: 任务问题：{0}

# DashNpcRuntimeCardTitle.Text
source: NPC Runtime
zh_cn: NPC 运行时

# DashNpcRuntimeLogsButton.Content
source: Logs
zh_cn: 日志

source: Open NPC runtime logs
zh_cn: 打开 NPC 运行时日志

# DashNpcRuntimeOpenRuntimeButton.Content
source: Open Inspector
zh_cn: 前往观察台

source: Open the developer NPC inspector
zh_cn: 打开开发者 NPC 观察台

# DashNpcRuntimeRuntimesLabel.Text
source: Runtimes
zh_cn: 运行实例

# DashNpcRuntimeBridgeLabel.Text
source: Bridge
zh_cn: 桥接

# DashNpcRuntimeBridgeInitial.Text
source: Not connected
zh_cn: 未连接

# DashNpcRuntimeLastTraceLabel.Text
source: Last Trace
zh_cn: 最近追踪

# DashNpcRuntimeLastErrorLabel.Text
source: Last Error
zh_cn: 最近错误

# DashNpcRuntimeSummaryHint.Text
source: This dashboard card is read-only. Use Developer / NPC Inspector for decisions, files, model replies, tool calls, delegation, and logs.
zh_cn: 此处只显示摘要。完整 NPC 决策、文件、模型回复、工具调用和日志在“开发者 / NPC 观察台”。

# DashNpcRuntimeDebugLabel.Text
source: Debug-only Stardew speak test
zh_cn: 仅调试用的星露谷说话测试

# DashNpcRuntimeDebugHaleySpeakButton.Content
source: Debug Haley Speak
zh_cn: 调试海莉说话

source: Send a debug Haley speech command
zh_cn: 发送 Haley 调试说话命令

# DashNpcRuntimeDebugPennySpeakButton.Content
source: Debug Penny Speak
zh_cn: 调试潘妮说话

source: Send a debug Penny speech command
zh_cn: 发送 Penny 调试说话命令

# DashNpcRuntimeRunHaleyTickButton.Content
source: Run Haley Tick
zh_cn: 运行海莉单轮自主循环

source: Run one Haley autonomy tick
zh_cn: 运行一次海莉自主循环

# DashNpcRuntimeManualActionInitial.Text
source: Normal path: clicking Haley in the game records completed dialogue facts only; Run Haley Tick lets the Desktop/core Haley runtime observe and decide the next step itself.
zh_cn: 正常路径：在游戏中点击海莉只记录已完成的对话事实；运行单轮自主循环会让桌面端里的海莉运行时自己观察并决定下一步。

# DashNpcRuntimeDebugHaleySpeakText
source: Hi, this is Haley speaking through the Hermes Stardew bridge.
zh_cn: 嗨，我是 Haley，正在通过 Hermes 星露谷桥接说话。

# DashNpcRuntimeDebugPennySpeakText
source: Hello, this is Penny speaking through the Hermes Stardew bridge.
zh_cn: 你好，我是 Penny，正在通过 Hermes 星露谷桥接说话。

# DashNpcRuntimeDebugActionsUnavailable
source: Stardew debug actions are not available in this build.
zh_cn: 当前构建不支持星露谷调试动作。

# DashNpcRuntimeSendingDebugDialogueFormat
source: Sending debug dialogue to {0}...
zh_cn: 正在向 {0} 发送调试对话...

# DashNpcRuntimeDebugDialogueSentFormat
source: Debug {0} dialogue sent. Check the game window.
zh_cn: {0} 的调试对话已发送。请查看游戏窗口。

# DashNpcRuntimeDebugDialogueFailedFormat
source: Debug {0} dialogue failed: {1}. Restart SMAPI after rebuilding the mod if this is the first test after this update.
zh_cn: {0} 调试对话失败：{1}。如果这是更新后的首次测试，请重建 mod 后重启 SMAPI。

# DashNpcRuntimeTickDebugUnavailable
source: Stardew autonomy tick debug is not available in this build.
zh_cn: 当前构建不支持星露谷单轮自主循环调试。

# DashNpcRuntimeRunningTickFormat
source: Running one {0} autonomy tick...
zh_cn: 正在运行一次 {0} 自主循环...

# DashNpcRuntimeTickCompletedFormat
source: Tick completed: trace={0}, observations={1}, events={2}.
zh_cn: 自主循环完成：追踪={0}，观察事实={1}，事件={2}。

# DashNpcRuntimeTickFailedFormat
source: Tick failed: {0}.
zh_cn: 自主循环失败：{0}。

# AgentTabAgentsButton.Content
source: Agents
zh_cn: 智能体

source: Show saved agents
zh_cn: 显示已保存智能体

# AgentTabIdentityButton.Content
source: Identity
zh_cn: 身份

source: Show identity files
zh_cn: 显示身份文件

# AgentTabSoulsButton.Content
source: Souls
zh_cn: Soul

source: Show soul browser
zh_cn: 显示 Soul 浏览器

# AgentTabRuntimeButton.Content
source: Runtime
zh_cn: 运行时

source: Show NPC runtime workbench
zh_cn: 显示 NPC 运行时工作台

# AgentRuntimeHeaderTitle.Text
source: NPC Runtime
zh_cn: NPC 运行时

# AgentRuntimeHeaderSubtitle.Text
source: Runtime state, bridge health, and recent traces for Stardew NPC agents. Controlled debug actions are now in the developer inspector.
zh_cn: 查看星露谷 NPC 智能体的运行状态、桥接健康和最近追踪；受控调试动作已集中到开发者观察台。

# AgentRuntimeOpenLogsButton.Content
source: Open Logs
zh_cn: 打开日志

# AgentRuntimeOpenDeveloperButton.Content
source: Open Inspector
zh_cn: 前往观察台

# AgentRuntimeRuntimesLabel.Text
source: Runtimes
zh_cn: 运行实例

# AgentRuntimeBridgeLabel.Text
source: Bridge
zh_cn: 桥接

# AgentRuntimeBridgeInitial.Text
source: Not connected
zh_cn: 未连接

# AgentRuntimeLastTraceLabel.Text
source: Last Trace
zh_cn: 最近追踪

# AgentRuntimeLastErrorLabel.Text
source: Last Error
zh_cn: 最近错误

# AgentRuntimeListTitle.Text
source: Runtime List
zh_cn: 运行时列表

source: NPC runtime list
zh_cn: NPC 运行时列表

# DeveloperPageEyebrow.Text
source: Developer
zh_cn: 开发者

# DeveloperPageTitle.Text
source: NPC Inspector
zh_cn: NPC 观察台

# DeveloperPageSubtitle.Text
source: Read-only view of NPC runtime, context files, model replies, tool calls, delegation, tasks, todos, and log paths.
zh_cn: 只读查看 NPC 的运行时、上下文文件、模型回复、工具调用、委托链路、任务与待办和日志路径。

# DeveloperRefreshButton.Content
source: Refresh
zh_cn: 刷新

source: Refresh the NPC inspector
zh_cn: 刷新 NPC 观察台

# DeveloperOpenRuntimeDirectoryButton.Content
source: Open Folder
zh_cn: 打开目录

source: Open the NPC runtime folder
zh_cn: 打开 NPC 运行时目录

# DeveloperRuntimeCountLabel.Text
source: Runtimes
zh_cn: 运行实例

# DeveloperBridgeLabel.Text
source: Bridge
zh_cn: 桥接状态

# DeveloperMainChannelLabel.Text
source: Channels
zh_cn: 通道

# DeveloperLastErrorLabel.Text
source: Last Error
zh_cn: 最近错误

# DeveloperNpcListTitle.Text
source: NPC List
zh_cn: NPC 列表

# DeveloperNpcListSubtitle.Text
source: Select an NPC to inspect read-only diagnostics.
zh_cn: 选择一个 NPC 查看只读诊断。

# DeveloperNpcList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: NPC list
zh_cn: NPC 列表

# DeveloperSelectedNpcLabel.Text
source: Selected NPC
zh_cn: 当前 NPC

# DeveloperSessionLabel.Text
source: Session
zh_cn: 会话

# DeveloperTraceLabel.Text
source: Latest Trace
zh_cn: 最近追踪

# DeveloperStateLabel.Text
source: State
zh_cn: 状态

# DeveloperDocumentsTitle.Text
source: Files and Context
zh_cn: 资料与上下文

source: NPC context file list
zh_cn: NPC 资料文件列表

# DeveloperDocumentPreviewTitle.Text
source: Read-only Preview
zh_cn: 只读预览

# DeveloperTimelineTitle.Text
source: Timeline
zh_cn: 时间线

# DeveloperTraceList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: NPC trace timeline
zh_cn: NPC 追踪时间线

# DeveloperDetailsTitle.Text
source: Details
zh_cn: 详情

# DeveloperDetailModelButton.Content
source: Model Reply
zh_cn: 模型回复

source: Show model replies
zh_cn: 显示模型回复

# DeveloperDetailToolButton.Content
source: Tool Calls
zh_cn: 工具调用

source: Show tool calls
zh_cn: 显示工具调用

# DeveloperDetailDelegationButton.Content
source: Delegation
zh_cn: 委托链路

source: Show delegation chain
zh_cn: 显示委托链路

# DeveloperDetailTodoButton.Content
source: Tasks and Todos
zh_cn: 任务与待办

source: Show tasks and todos
zh_cn: 显示任务与待办

# DeveloperDetailLogsButton.Content
source: Logs
zh_cn: 日志

source: Show log paths and parse diagnostics
zh_cn: 显示日志路径与解析诊断

# DeveloperDetailContextButton.Content
source: Context Diff
zh_cn: 上下文差异

source: Show context injection differences
zh_cn: 显示上下文注入差异

source: Model reply list
zh_cn: 模型回复列表

source: Tool call list
zh_cn: 工具调用列表

source: Delegation chain list
zh_cn: 委托链路列表

# DeveloperTodoList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Task and todo list
zh_cn: 任务与待办列表

source: Context injection difference list
zh_cn: 上下文注入差异列表

# DeveloperRuntimeUnavailable
source: The developer inspector is not available in this build.
zh_cn: 当前构建不支持开发者观察台。

# DeveloperNoNpcEmptyState
source: No observable NPC is available.
zh_cn: 暂无可观察的 NPC。

# DeveloperRuntimeSnapshotMissing
source: No active runtime snapshot was found for this NPC.
zh_cn: 未找到该 NPC 的活动运行时快照。

# DeveloperLoadFailedFormat
source: Failed to load inspector data: {0}
zh_cn: 加载观察数据失败：{0}

# DeveloperNoDocumentSelected
source: Select a context file.
zh_cn: 请选择一个资料文件。

# DeveloperRuntimePathFormat
source: Runtime folder: {0}
zh_cn: 运行时目录：{0}

# DeveloperRuntimeLogPathFormat
source: Activity log: {0}
zh_cn: 活动日志：{0}

# DeveloperNoTraceDiagnostics
source: No parse diagnostics.
zh_cn: 没有解析诊断。

# DeveloperControlledDebugTitle.Text
source: Controlled Debug
zh_cn: 受控调试

# DeveloperControlledDebugDescription.Text
source: These actions send explicit debug commands through the game bridge. Moving to town is a debug teleport, not natural movement evidence.
zh_cn: 这些动作会向游戏桥接层发送显式调试命令；放置到镇上是调试传送，不计入自然移动验收。

# DeveloperDebugRepositionButton.Content
source: Move to Town
zh_cn: 放到镇上

source: Move the selected NPC to town
zh_cn: 将选中 NPC 放到镇上

# DeveloperDebugTickButton.Content
source: Run One Tick
zh_cn: 单步唤醒

source: Run one autonomy tick for the selected NPC
zh_cn: 运行选中 NPC 的一次自主循环

# DeveloperDebugSpeakButton.Content
source: Send Debug Line
zh_cn: 发送调试台词

source: Send a debug dialogue line for the selected NPC
zh_cn: 让选中 NPC 发送一条调试台词

# DeveloperDebugBeachRouteButton.Content
source: Send Haley to Beach
zh_cn: 让海莉去海边

source: Submit a mechanical Beach shoreline move command for Haley
zh_cn: 向桥接层提交让海莉去 Beach 海岸线的机械坐标移动

# DeveloperDebugActionStatusInitial.Text
source: Select an NPC to run controlled debug actions.
zh_cn: 选择 NPC 后可执行受控调试动作。

# DeveloperDebugActionResultInitial.Text
source: No debug action has run yet.
zh_cn: 尚未执行调试动作。

# DeveloperTraceFilterTitle.Text
source: Trace Filter and Export
zh_cn: 追踪筛选与导出

# DeveloperTraceIdFilterBox.Header
source: Trace id
zh_cn: 追踪 id

source: Filter by trace id
zh_cn: 按追踪 id 筛选

# DeveloperEventTypeFilterBox.Header
source: Event type
zh_cn: 事件类型

source: Filter by event type
zh_cn: 按事件类型筛选

# DeveloperCommandIdFilterBox.Header
source: Command id
zh_cn: 命令 id

source: Filter by command id
zh_cn: 按命令 id 筛选

# DeveloperToolNameFilterBox.Header
source: Tool name
zh_cn: 工具名

source: Filter by tool name
zh_cn: 按工具名筛选

# DeveloperErrorCodeFilterBox.Header
source: Error code
zh_cn: 错误码

source: Filter by error code
zh_cn: 按错误码筛选

# DeveloperKeywordFilterBox.Header
source: Keyword
zh_cn: 关键词

source: Filter by keyword
zh_cn: 按文本关键词筛选

# DeveloperApplyTraceFilterButton.Content
source: Apply Filter
zh_cn: 应用筛选

source: Apply trace filters
zh_cn: 应用追踪筛选条件

# DeveloperClearTraceFilterButton.Content
source: Clear Filter
zh_cn: 清除筛选

source: Clear trace filters
zh_cn: 清除追踪筛选条件

# DeveloperExportDiagnosticsButton.Content
source: Export Diagnostics
zh_cn: 导出诊断包

source: Export a redacted diagnostics package for the selected NPC
zh_cn: 导出选中 NPC 的脱敏诊断包

# DeveloperDiagnosticsExportInitial.Text
source: Diagnostics packages are written to the local diagnostics folder with automatic redaction.
zh_cn: 诊断包会导出到本地 diagnostics 目录并自动脱敏。

# DeveloperDebugRepositionActionName
source: Move to Town
zh_cn: 放到镇上

# DeveloperDebugTickActionName
source: Run One Tick
zh_cn: 单步唤醒

# DeveloperDebugSpeakActionName
source: Send Debug Line
zh_cn: 发送调试台词

# DeveloperDebugSpeakText
source: This is a debug line sent from the developer inspector.
zh_cn: 这是一条开发者页发送的调试台词。

# DeveloperDebugBeachRouteActionName
source: Send Haley to Beach
zh_cn: 让海莉去海边

# DeveloperDebugHaleyDisplayName
source: Haley
zh_cn: 海莉

# DeveloperDebugActionRunningFormat
source: Running "{0}" for {1}
zh_cn: 正在执行“{0}”：{1}

# DeveloperDebugActionSuccessFormat
source: "{0}" was submitted. commandId={1} traceId={2}
zh_cn: “{0}”已提交。commandId={1} traceId={2}

# DeveloperDebugActionFailedFormat
source: "{0}" failed. Raw error code: {1}
zh_cn: “{0}”失败。原始错误码：{1}

# DeveloperDebugTickSuccessFormat
source: One tick completed. traceId={0} observationFacts={1} eventFacts={2}
zh_cn: 单步唤醒完成。traceId={0} observationFacts={1} eventFacts={2}

# DeveloperDebugNoSelection
source: Select an active NPC first.
zh_cn: 请先选择一个活动 NPC。

# DeveloperDebugBridgeUnavailable
source: The bridge is not connected or the save identity is stale, so controlled actions are disabled.
zh_cn: 桥接未连接或存档身份已过期，暂不能执行受控动作。

# DeveloperDebugServiceUnavailable
source: The matching debug service is not registered in this build.
zh_cn: 当前构建未注册对应调试服务。

# DeveloperDebugActionServiceUnavailable
source: Reposition and debug speech services are unavailable; one-step wake is still available.
zh_cn: 放置与调试台词服务不可用；单步唤醒仍可用。

# DeveloperDebugTickServiceUnavailable
source: One-step wake service is unavailable; reposition and debug speech are still available.
zh_cn: 单步唤醒服务不可用；放置与调试台词仍可用。

# DeveloperDebugActionInProgress
source: A debug or export operation is already running.
zh_cn: 已有调试或导出操作正在执行。

# DeveloperDebugActionReady
source: NPC selected and bridge ready. A confirmation appears before execution.
zh_cn: 已选择 NPC，桥接可用。执行前会再次确认。

# DeveloperDebugConfirmTitle
source: Confirm controlled debug action
zh_cn: 确认受控调试动作

# DeveloperDebugConfirmContentFormat
source: About to run "{0}" for {1}. This changes game state for debugging only and does not prove natural behavior succeeded.
zh_cn: 即将对 {1} 执行“{0}”。这会影响游戏内状态，仅用于调试，不代表自然行为成功。

# DeveloperDebugConfirmPrimaryButton
source: Run
zh_cn: 执行

# DeveloperDebugConfirmCancelButton
source: Cancel
zh_cn: 取消

# DeveloperDiagnosticsExportUnavailable
source: No active NPC diagnostics are available to export.
zh_cn: 没有可导出的活动 NPC 诊断。

# DeveloperDiagnosticsExportRunning
source: Generating redacted diagnostics package...
zh_cn: 正在生成脱敏诊断包...

# DeveloperDiagnosticsExportSuccessFormat
source: Diagnostics package exported: {0}
zh_cn: 诊断包已导出：{0}

# DeveloperDiagnosticsExportFailedFormat
source: Diagnostics export failed: {0}
zh_cn: 诊断包导出失败：{0}

# DeveloperContextBlockEmptyState
source: The current trace has no context injection difference records.
zh_cn: 当前追踪没有上下文注入差异记录。

# DeveloperContextCharsBeforeLabel.Text
source: chars before
zh_cn: 注入前字符

# DeveloperContextCharsAfterLabel.Text
source: chars after
zh_cn: 注入后字符

# DeveloperContextTokensLabel.Text
source: estimated tokens
zh_cn: 估算 token

# DeveloperContextTrimmedLabel.Text
source: trimmed
zh_cn: 已裁剪

# DeveloperInspectorFileMissing
source: File not found.
zh_cn: 未找到文件。

# DeveloperInspectorFileLoaded
source: Loaded.
zh_cn: 已读取。

# DeveloperInspectorFileTruncatedFormat
source: Truncated. Showing the first {0} characters only.
zh_cn: 已截断，仅显示前 {0} 个字符。

# DeveloperInspectorFileReadFailedFormat
source: Read failed: {0}
zh_cn: 读取失败：{0}

# DeveloperInspectorTraceLogMissing
source: Runtime activity log was not found.
zh_cn: 未找到运行时活动日志。

# DeveloperInspectorTraceParseFailedFormat
source: Line {0} could not be parsed: {1}
zh_cn: 第 {0} 行无法解析：{1}

# DeveloperInspectorTraceEmptyForNpc
source: This NPC has no runtime events to show.
zh_cn: 当前 NPC 没有可显示的运行时事件。

# DeveloperInspectorTraceSelectionMissing
source: Selected trace was not found.
zh_cn: 未找到所选追踪。

# DeveloperInspectorTranscriptSessionMissing
source: This NPC has no associated session.
zh_cn: 当前 NPC 没有关联会话。

# DeveloperInspectorModelReplyEmpty
source: No model replies have been saved for this session yet.
zh_cn: 当前会话还没有保存模型回复。

# DeveloperInspectorToolCallEmpty
source: No tool calls are recorded here.
zh_cn: 当前记录未包含工具调用。

# DeveloperInspectorDelegationEmpty
source: No delegation was found in this trace.
zh_cn: 本次追踪未发现委托。

# DeveloperInspectorTodoEmpty
source: This session has no todos.
zh_cn: 当前会话没有待办事项。

# DeveloperInspectorReasoningMissing
source: No reasoning summary was recorded.
zh_cn: 当前记录未包含推理摘要。

# DeveloperInspectorToolResultMissing
source: No tool result was recorded.
zh_cn: 当前记录未包含工具结果。

# DeveloperInspectorTraceKindObservation
source: Observation
zh_cn: 观察事实

# DeveloperInspectorTraceKindModelRequest
source: Model Request
zh_cn: 模型请求

# DeveloperInspectorTraceKindModelReply
source: Model Reply
zh_cn: 模型回复

# DeveloperInspectorTraceKindIntent
source: Intent Parsing
zh_cn: 意图解析

# DeveloperInspectorTraceKindLocalExecutor
source: Local Execution
zh_cn: 本地执行

# DeveloperInspectorTraceKindToolCall
source: Tool Call
zh_cn: 工具调用

# DeveloperInspectorTraceKindBridge
source: Game Bridge
zh_cn: 游戏桥接

# DeveloperInspectorTraceKindResult
source: Execution Result
zh_cn: 执行结果

# DeveloperInspectorTraceKindDiagnostic
source: Diagnostic
zh_cn: 诊断

# DeveloperInspectorTraceKindRaw
source: Raw Event
zh_cn: 原始事件

# AgentRuntimeUnavailable
source: NPC runtime workspace is not available in this build.
zh_cn: 当前构建不支持 NPC 运行时工作台。
